run/CHT/openFuelCell/system/controlDict.run
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     openFuelCell;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e3;

deltaT          1;

writeControl    runTime;

writeInterval   1e3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression  off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //

