run/CHT/openFuelCell/0/hot/T
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          yH2;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 973.15;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }

    hotInlet
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
